Revit 2027 API
PathOfTravelCalculationStatus Enumeration
 An enumerated type containing possible results of the Path of Travel calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PathOfTravelCalculationStatus
Public Enumeration PathOfTravelCalculationStatus
public enum class PathOfTravelCalculationStatus
type PathOfTravelCalculationStatus
Members
Member name | Value | Description
AreaTooLarge | 2 |  The view outline is too large. Calculation of the path of travel cannot be performed.
NoPathOfTravel | 1 |  There is no valid path between the two points.
PointOutsideActiveCrop | 6 |  Start or end point is outside the active view crop.
ResultAffectedByCrop | 4 |  The view has an active crop region set. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains no points, no path of travel was found inside the crop region, but a valid path may exist outside of it. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains valid points, a path of travel was found inside the crop region, but a better option may exist outside of it.
RevealObstaclesModeFailureDataExist | 8 |  Reveal Obstacles mode cannot be set for the view because analysis data exist in the view.
RevealObstaclesModeFailureWireframe | 9 |  Reveal Obstacles mode cannot be set for the view because wireframe display style is set for the view.
SplitView | 3 |  The view is split. Calculation of the path of travel cannot be performed.
StartAndEndPointsTooClose | 5 |  Distance between adjacent points of path of travel (start, end and way points) is less than the value of [!:Autodesk::Revit::DB::Analysis::RouteAnalysisSettings::MinimumLength].
Success | 0 |  A valid path of travel between the two points was found. Use [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] to retrieve the calculated points of path of travel.
TemporaryModeFailureDataExist | 10 |  Temporary mode cannot be set for the view because analysis data exist in the view.
TemporaryModeFailureWireframe | 11 |  Temporary mode cannot be set for the view because wireframe display style is set for the view.
TooMuchGeometry | 7 |  The view is exporting too much geometry. Calculation of the path of travel cannot be performed.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace